-- MariaDB dump 10.19  Distrib 10.6.7-MariaDB, for Win64 (AMD64)
--
-- Host: localhost    Database: city
-- ------------------------------------------------------
-- Server version	10.6.7-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `do`
--

DROP TABLE IF EXISTS `do`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `do` (
  `doNum` int(11) NOT NULL AUTO_INCREMENT,
  `doname` varchar(10) NOT NULL,
  `code` int(10) DEFAULT NULL,
  PRIMARY KEY (`doNum`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `do`
--

LOCK TABLES `do` WRITE;
/*!40000 ALTER TABLE `do` DISABLE KEYS */;
INSERT INTO `do` VALUES (1,'전체/도',0),(2,'서울특별시',11),(3,'부산광역시',26),(4,'대구광역시',27),(5,'인천광역시',28),(6,'광주광역시',29),(7,'대전광역시',30),(8,'울산광역시',31),(9,'세종특별자치시',36),(10,'경기도',41),(11,'강원도',42),(12,'충청북도',43),(13,'충청남도',44),(14,'경상북도',47),(15,'경상남도',48),(16,'전라북도',45),(17,'전라남도',46),(18,'제주도',50);
/*!40000 ALTER TABLE `do` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `si`
--

DROP TABLE IF EXISTS `si`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `si` (
  `doNum` int(10) DEFAULT NULL,
  `siname` varchar(10) NOT NULL,
  KEY `doNum` (`doNum`),
  CONSTRAINT `si_ibfk_1` FOREIGN KEY (`doNum`) REFERENCES `do` (`doNum`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `si`
--

LOCK TABLES `si` WRITE;
/*!40000 ALTER TABLE `si` DISABLE KEYS */;
INSERT INTO `si` VALUES (1,'전체/시/군'),(2,'전체/시/군'),(2,'종로구'),(2,'중구'),(2,'용산구'),(2,'성동구'),(2,'광진구'),(2,'동대문구'),(2,'중랑구'),(2,'성북구'),(2,'강북구'),(2,'도봉구'),(2,'노원구'),(2,'은평구'),(2,'서대문구'),(2,'마포구'),(2,'양천구'),(2,'강서구'),(2,'구로구'),(2,'금천구'),(2,'영등포구'),(2,'동작구'),(2,'관악구'),(2,'서초구'),(2,'강남구'),(2,'송파구'),(2,'강동구'),(3,'전체/시/군'),(3,'중구'),(3,'서구'),(3,'동구'),(3,'영도구'),(3,'부산진구'),(3,'동래구'),(3,'남구'),(3,'북구'),(3,'강서구'),(3,'해운대구'),(3,'사하구'),(3,'금정구'),(3,'연제구'),(3,'수영구'),(3,'사상구'),(3,'기장군'),(4,'전체/시/군'),(4,'중구'),(4,'동구'),(4,'서구'),(4,'남구'),(4,'북구'),(4,'수성구'),(4,'달서구'),(4,'달성군'),(5,'전체/시/군'),(5,'중구'),(5,'동구'),(5,'미추홀구'),(5,'연수구'),(5,'남동구'),(5,'부평구'),(5,'계양구'),(5,'서구'),(5,'강화군'),(5,'옹진군'),(6,'전체/시/군'),(6,'동구'),(6,'서구'),(6,'남구'),(6,'북구'),(6,'광산구'),(7,'전체/시/군'),(7,'동구'),(7,'중구'),(7,'서구'),(7,'유성구'),(7,'대덕구'),(8,'전체/시/군'),(8,'중구'),(8,'남구'),(8,'동구'),(8,'북구'),(8,'울주군'),(9,'전체/시/군'),(9,'금남면'),(9,'부강면'),(9,'소정면'),(9,'연기면'),(9,'연동면'),(9,'연서면'),(9,'장군면'),(9,'전동면'),(9,'전의면'),(9,'조치원읍'),(9,'가람동'),(9,'고운동'),(9,'나성동'),(9,'다정동'),(9,'대평동'),(9,'도담동'),(9,'반곡동'),(9,'보람동'),(9,'산울동'),(9,'새롬동'),(9,'소담동'),(9,'아름동'),(9,'어진동'),(9,'종촌동'),(9,'집현동'),(9,'한솔동'),(9,'함강동'),(9,'해밀동'),(10,'전체/시/군'),(10,'고양시'),(10,'과천시'),(10,'광명시'),(10,'광주시'),(10,'구리시'),(10,'군포시'),(10,'김포시'),(10,'남양주시'),(10,'동두천시'),(10,'부천시'),(10,'성남시'),(10,'수원시'),(10,'시흥시'),(10,'안산시'),(10,'안성시'),(10,'안양시'),(10,'양주시'),(10,'오산시'),(10,'용인시'),(10,'의왕시'),(10,'의정부시'),(10,'이천시'),(10,'파주시'),(10,'평택시'),(10,'포천시'),(10,'하남시'),(10,'화성시'),(10,'연천군'),(10,'가평군'),(10,'양평군'),(11,'전체/시/군'),(11,'강릉시'),(11,'동해시'),(11,'삼척시'),(11,'속초시'),(11,'원주시'),(11,'춘천시'),(11,'태백시'),(11,'홍천군'),(11,'횡성군'),(11,'영월군'),(11,'평창군'),(11,'정선군'),(11,'철원군'),(11,'화천군'),(11,'양구군'),(11,'인제군'),(11,'고성군'),(11,'양양군'),(12,'전체/시/군'),(12,'제천시'),(12,'청주시'),(12,'충주시'),(12,'보은군'),(12,'옥천군'),(12,'영동군'),(12,'증평군'),(12,'진천군'),(12,'괴산군'),(12,'음성군'),(12,'단양군'),(13,'전체/시/군'),(13,'계룡시'),(13,'공주시'),(13,'논산시'),(13,'당진시'),(13,'보령시'),(13,'서산시'),(13,'아산시'),(13,'천안시'),(13,'금산군'),(13,'부여군'),(13,'서천군'),(13,'청양군'),(13,'홍성군'),(13,'예산군'),(13,'태안군'),(14,'전체/시/군'),(14,'경산시'),(14,'경주시'),(14,'구미시'),(14,'김천시'),(14,'문경시'),(14,'상주시'),(14,'안동시'),(14,'영주시'),(14,'영천시'),(14,'포항시'),(14,'군위군'),(14,'의성군'),(14,'청송군'),(14,'영양군'),(14,'영덕군'),(14,'청도군'),(14,'고령군'),(14,'성주군'),(14,'칠곡군'),(14,'예천군'),(14,'봉화군'),(14,'울진군'),(14,'울릉군'),(15,'전체/시/군'),(15,'거제시'),(15,'김해시'),(15,'밀양시'),(15,'사천시'),(15,'양산시'),(15,'진주시'),(15,'창원시'),(15,'통영시'),(15,'의령군'),(15,'함안군'),(15,'창녕군'),(15,'고성군'),(15,'남해군'),(15,'하동군'),(15,'산청군'),(15,'함양군'),(15,'거창군'),(15,'합천군'),(16,'전체/시/군'),(16,'군산시'),(16,'김제시'),(16,'남원시'),(16,'익산시'),(16,'전주시'),(16,'정읍시'),(16,'완주군'),(16,'진안군'),(16,'무주군'),(16,'장수군'),(16,'임실군'),(16,'순창군'),(16,'고창군'),(16,'부안군'),(17,'전체/시/군'),(17,'광양시'),(17,'나주시'),(17,'목포시'),(17,'순천시'),(17,'여수시'),(17,'담양군'),(17,'곡성군'),(17,'구례군'),(17,'고흥군'),(17,'보성군'),(17,'화순군'),(17,'장흥군'),(17,'강진군'),(17,'해남군'),(17,'영암군'),(17,'무안군'),(17,'함평군'),(17,'영광군'),(17,'장성군'),(17,'완도군'),(17,'진도군'),(17,'신안군'),(18,'전체/시/군'),(18,'서귀포시'),(18,'제주시');
/*!40000 ALTER TABLE `si` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-06-02  5:23:40
